; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
	Planet26 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet23)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon25)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared2)
	(supports instrument9 spectrograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 Star3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument10 image1)
	(calibration_target instrument10 Star1)
	(supports instrument11 image1)
	(supports instrument11 spectrograph0)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star0)
	(supports instrument12 infrared2)
	(supports instrument12 spectrograph0)
	(supports instrument12 image1)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star16)
)
(:goal (and
	(have_image Phenomenon4 spectrograph0)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 infrared2)
	(have_image Phenomenon8 image1)
	(have_image Planet10 image1)
	(have_image Star11 infrared2)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 image1)
	(have_image Star15 infrared2)
	(have_image Star16 spectrograph0)
	(have_image Star18 infrared2)
	(have_image Phenomenon19 spectrograph0)
	(have_image Star20 infrared2)
	(have_image Phenomenon21 infrared2)
	(have_image Star22 spectrograph0)
	(have_image Planet23 image1)
	(have_image Phenomenon24 infrared2)
	(have_image Phenomenon25 infrared2)
	(have_image Planet26 spectrograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 20
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 20
3. (calibrate satellite3 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 0 of 20
4. (turn_to satellite3 phenomenon13 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon13)
   goals met: 0 of 20
5. (take_image satellite3 phenomenon13 instrument8 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 1 of 20
6. (turn_to satellite3 phenomenon19 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon19)
   goals met: 1 of 20
7. (take_image satellite3 phenomenon19 instrument8 spectrograph0)
   added: (have_image phenomenon19 spectrograph0)
   goals met: 2 of 20
8. (turn_to satellite3 phenomenon21 phenomenon19)
   deleted: (pointing satellite3 phenomenon19)
   added: (pointing satellite3 phenomenon21)
   goals met: 2 of 20
9. (take_image satellite3 phenomenon21 instrument8 infrared2)
   added: (have_image phenomenon21 infrared2)
   goals met: 3 of 20
10. (turn_to satellite3 phenomenon24 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon24)
   goals met: 3 of 20
11. (take_image satellite3 phenomenon24 instrument8 infrared2)
   added: (have_image phenomenon24 infrared2)
   goals met: 4 of 20
12. (turn_to satellite3 phenomenon25 phenomenon24)
   deleted: (pointing satellite3 phenomenon24)
   added: (pointing satellite3 phenomenon25)
   goals met: 4 of 20
13. (take_image satellite3 phenomenon25 instrument8 infrared2)
   added: (have_image phenomenon25 infrared2)
   goals met: 5 of 20
14. (turn_to satellite3 phenomenon4 phenomenon25)
   deleted: (pointing satellite3 phenomenon25)
   added: (pointing satellite3 phenomenon4)
   goals met: 5 of 20
15. (take_image satellite3 phenomenon4 instrument8 spectrograph0)
   added: (have_image phenomenon4 spectrograph0)
   goals met: 6 of 20
16. (turn_to satellite3 phenomenon6 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 phenomenon6)
   goals met: 6 of 20
17. (take_image satellite3 phenomenon6 instrument8 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 7 of 20
18. (turn_to satellite3 phenomenon8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon8)
   goals met: 7 of 20
19. (take_image satellite3 phenomenon8 instrument8 image1)
   added: (have_image phenomenon8 image1)
   goals met: 8 of 20
20. (turn_to satellite3 planet10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet10)
   goals met: 8 of 20
21. (take_image satellite3 planet10 instrument8 image1)
   added: (have_image planet10 image1)
   goals met: 9 of 20
22. (turn_to satellite3 planet14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet14)
   goals met: 9 of 20
23. (take_image satellite3 planet14 instrument8 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 20
24. (turn_to satellite3 planet23 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet23)
   goals met: 10 of 20
25. (take_image satellite3 planet23 instrument8 image1)
   added: (have_image planet23 image1)
   goals met: 11 of 20
26. (turn_to satellite3 planet26 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet26)
   goals met: 11 of 20
27. (take_image satellite3 planet26 instrument8 spectrograph0)
   added: (have_image planet26 spectrograph0)
   goals met: 12 of 20
28. (turn_to satellite3 planet7 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 planet7)
   goals met: 12 of 20
29. (take_image satellite3 planet7 instrument8 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 13 of 20
30. (turn_to satellite3 star11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star11)
   goals met: 13 of 20
31. (take_image satellite3 star11 instrument8 infrared2)
   added: (have_image star11 infrared2)
   goals met: 14 of 20
32. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 14 of 20
33. (take_image satellite3 star12 instrument8 infrared2)
   added: (have_image star12 infrared2)
   goals met: 15 of 20
34. (turn_to satellite3 star15 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star15)
   goals met: 15 of 20
35. (take_image satellite3 star15 instrument8 infrared2)
   added: (have_image star15 infrared2)
   goals met: 16 of 20
36. (turn_to satellite3 star16 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star16)
   goals met: 16 of 20
37. (take_image satellite3 star16 instrument8 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 17 of 20
38. (turn_to satellite3 star18 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star18)
   goals met: 17 of 20
39. (take_image satellite3 star18 instrument8 infrared2)
   added: (have_image star18 infrared2)
   goals met: 18 of 20
40. (turn_to satellite3 star20 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 star20)
   goals met: 18 of 20
41. (take_image satellite3 star20 instrument8 infrared2)
   added: (have_image star20 infrared2)
   goals met: 19 of 20
42. (turn_to satellite3 star22 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 star22)
   goals met: 19 of 20
43. (take_image satellite3 star22 instrument8 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 20 of 20
